export default class expressionUtils {
    static arr = [
      { "cron": "0/2 * * * * ?", "desc": "表示每2秒 执行任务" },
      { "cron": "0 0/2 * * * ?", "desc": "表示每2分钟 执行任务" },
      { "cron": "0 0 2 1 * ?", "desc": " 表示在每月的1日的凌晨2点调整任务" },
      { "cron": "0 15 10 ? 6L 2002-2006", "desc": "表示2002-2006年的每个月的最后一个星期五上午10:15执行作" },
      { "cron": "0 0 10,14,16 * * ?", "desc": "每天上午10点，下午2点，4点" },
      { "cron": "0 0/30 9-17 * * ?", "desc": "朝九晚五工作时间内每半小时" },
      { "cron": "0 0 12 * * ?", "desc": "每天中午12点触发" },
      { "cron": "0 15 10 ? * *", "desc": "每天上午10:15触发" },
      { "cron": "0 15 10 * * ?", "desc": "每天上午10:15触发" },
      { "cron": "0 * 14 * * ?", "desc": "在每天下午2点到下午2:59期间的每1分钟触发" },
      { "cron": "0 0/5 14 * * ?", "desc": "在每天下午2点到下午2:55期间的每5分钟触发" },
      { "cron": "0 15 10 15 * ?", "desc": "每月15日上午10:15触发" },
      { "cron": "0 15 10 L * ?", "desc": "每月最后一日的上午10:15触发 " },
      { "cron": "0 15 10 ? * 6L", "desc": "每月的最后一个星期五上午10:15触发" },
      { "cron": "0 15 10 ? * 6#3", "desc": "每月的第三个星期五上午10:15触发" },
    ];
    static demoArr = [
        { "cron": "0/2 * * * * ?", "desc": "表示每2秒 执行任务" },
        { "cron": "0 0/2 * * * ?", "desc": "表示每2分钟 执行任务" },
       
        { "cron": "0 0 12 * * ?", "desc": "每天中午12点触发" },
       
      ];
  
    static getAllExpression () {
      return expressionUtils.arr
    }
    static getDemoExpression () {
        return expressionUtils.demoArr
      }
  }